of-6/OpenFOAM-6-master/etc/templates/closedVolumeRotating/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    rotatingZone;

        patches
        {
            master
            {
                name            AMI1;
                type            cyclicAMI;
                matchTolerance  0.0001;
                neighbourPatch  AMI2;
                transform       noOrdering;
            }
            slave
            {
                $master;
                name            AMI2;
                neighbourPatch  AMI1;
            }
        }
    }
}

// ************************************************************************* //
